/**. Напишите программу, которая на вход принимает значение, а
на выходе показывает обратное значение.*/

Console.WriteLine("Введите число для нахождения обратного значения числа: ");
double A = System.Double.Parse(Console.ReadLine());
double B = 1/A;
Console.WriteLine(B);